{"pageProps":{"post":{"title":"A Whole New Whirled!","date":"2020-05-20T16:17:13.444Z","slug":"a-whole-new-whirled","content":"<p>Good afternoon!</p>\n<p>Wow, so I hadn't gotten to learning about <code>scp</code> in the other post even ... big couple of days, backing up the other computer, getting my repos organized, and I got my office supplies divvied up properly between my work desk, traditional desk, and writing desk, finally, almost six months later, lol. Woke up at 4 to get done what I've gotten done the past few days. Today was a quarter to 6 though, when Dawa alerted me to his need to go outside, and I hadn't heard that desperation in his tone for too long I guess and he poo'd the rug, and somehow I didn't even realize leaving the place, I just threw some shoes on and harnessed him up, and came back to it being cleaning time. Poor little guy threw up later in the day, too. 😦</p>\n<p>Okay, well, coming to you from an apartment that's like seriously clean right now and thinks to a certain set of windfalls, there's <strong>food</strong> in the fridge! Stoked, for right now though, I've got to continue backing up the other machine. Next I have to set up the symlinks for my dotfiles, add in the terminal theme and put it in git, and ... let's see, so I've got a repo in ~/Code that's tracking et ceteral code things, but dots has its own repo, as do courses, demos, projects, teaching, tech-tests, and templates.</p>\n<p>Oof, stoked to possibly have a decent chair in the budget, I sit for like five minutes as of late and my back is totally killing me. I think I actually need to pivot to cooking mode and walking Dawa again here soon, but I'm pretty stoked for the next time I can sit, just like, not at the end of the day when I'm <em>least</em> able to support my spine properly, no beuno. Stoked for tomorrow morning, basically, and I have some new motivations in my life! Tell you about them over a bev, my Internet friend!</p>\n<p>Best wishes!\n~g</p>\n"}},"__N_SSG":true}