{"pageProps":{"post":{"title":"Ahh!","date":"2020-07-27T11:51:06.570Z","slug":"ahh!","content":"<p>Good morning! Oh jeez, what a day so far! So I definitely messed the whole master-blaster program up, again, then I fixed it I think, but there's still a little bit to iron out. Fortunately, Dawa is cool just chillen for a while, since we got a nice trail run in, and I've had a second coffee, so let's do this!</p>\n<p>Eugh, okay, the clone command is throwing a warning that needs to be handled, what else ...</p>\n<p>Oh, lol, so what I broke, mainly, was if localDirectories was turned on, it would check the repo if it had a local directory, or if localDirectories was off, then it would check all repos, but I didn't have the else statement set up for if localDirectories was turned on and there was no local directory. Whooopsie.</p>\n<p>Also, why is the rm temp dir command not running properly? And why is it running push --delete origin master? And why is locallyBlastIt being cloned?! Ahh!</p>\n<p>Ohhkay, so if the remote is set with, say, 'twitchkidd' rather than 'Twitchkidd' with the capital T, the string check to see if there's a local copy of a repo fails!</p>\n<p>Omg I think I did it! Yes! It all works!</p>\n<p>// And I wrote out a contributing doc at the dog park!</p>\n<p>And we're settling for having to <code>pip install questionary</code> and <code>requests</code> in order to run it for now, at least it's pip and not pipenv.</p>\n<p>And it's on PyPi! Please nobody have gotten anything lower than v1.0.6, lol! Probably not.</p>\n<p>And so that was task 8 from yesterday, and then there's just the last one, to get the word out about it! 9: Tweet!</p>\n<p>Lol, I'm reaching for the command line because I'm still in the mode of working on <code>master-blaster</code>, but a) going to twitter.com is much easier, and b) done with working on <code>master-blaster</code> for a while! Almost a little bit of shock, like, wow, really, done for now, there's the version upgrade on pypi.org. Crazy.</p>\n<p>Yea, wow, okay, Tweeting, it's happening, I sent out like seven messages in bottles ... ooh, TerminusDB said it \"Looks great!\" Wow!</p>\n<p>Okay, other than being glued to Twitter, I'm done with this type of thing for the day, I'm wiped! It's cooking time, about to make some soup, rice, beans, and figure something out with red lentils!</p>\n<p>Best wishes! ~g</p>\n"}},"__N_SSG":true}