{"pageProps":{"post":{"title":"Continue?","date":"2020-04-13T07:55:12.200Z","slug":"continue","content":"<p>Good morning! I'm going to jump right into it, because after spending four and a half hours tutoring someone in React last night, I feel like I need to race to get my place back here. I'd just ... what did I do ... set up Mongo? Yea, the server was talking to Mongo, I think I was halfway through how to update documents with the NodeJS driver ... Oof, <em>one</em> step back though, I kept on having to look up how to do basic things and look up how class components looked, lol. Yay programming. Yea, as I close my tabs, this.handleChange.bind(this), what's the syntax and where do you put it ... How to use fetch to update state in a class component ... Do we need to use super() or super(props) in the constructor ... <strong>What are the attributes of an input, type 'text', lol</strong></p>\n<p>Okay, that one I think I knew, and was just showing them the docs at MDN. They were super smart, totally followed along with the concepts I was going over pretty quickly, brought correct terminology back around later in the conversation, and again, we were rocking and rolling for four and a half hours straight there, and you could tell they didn't have a whole lot of experience with like, typing, much less the HTML, CSS, JavaScript, git, CLI, and React parts. I did my best, I really hope they do well!</p>\n<p>OKAY MONGO TIME, DO NO MORE PROCRASTINATING.</p>\n<p>Yay, I'm on fiyah this morning! 🔥 Also I feel like the Mongo driver docs just played me into Googleing, \"What's upsert?\" ... \"Not much man, what's up with you? (Says Sert)\"</p>\n<p>Okay, sweet, tutorial time over, make stuff time. // Ooohkay, so I clearly need to restructure the routes and the connection, but I'm going to take a break, do some dishes, walk Dawa, and come back to this with a fresh mind.</p>\n<p>Oh, eff it, it's @wesbos time. I can't <em>really</em> afford this, but I can buy it, and I need a little boost right now. #learnNode!</p>\n<p>Okay, if my internet could come back, that would be great. ... Thank you hotspot!</p>\n<p>// Dang, nature, you scary! It's crazy out there, the busted gutter I told them about in Febuary got blown off the roof, the rain is coming in through the (closed) patio door, trees all gone cray, hod'dan'!</p>\n<p>Anyway, so I applied for five jobs today, and it was all <strong>terrifying!</strong> I ended up going back to the Node course, and I'm like a fifth of the way through. The templating language is weird! I guess pug/jade is popular, but whooaaa so weird!</p>\n"}},"__N_SSG":true}