{"pageProps":{"post":{"title":"Coronal Mass Ejection","date":"2020-04-04T13:14:02.119Z","slug":"coronal-mass-ejection","content":"<p>Okay, so first off, #coronalMassEjection is my new hashtag for losing weight put on during the Coronavirus pandemic. Quarantine getting in the way of getting fit and lean? Self isolation getting in the way of self care? Coronavirus have you going up a couple sizes? Being good about washing your hands but finding it hard to fit into your pants? #coronalMassEjection. This is day two for me, since a few days ago I tried going for a run and my Achilles acted up 4.2 miles in because I haven't really been training and have put on like ten pounds, so yesterday I worked out in my apartment, and today I went for a nice long bike ride ... and <em>then,</em> oh boy, got the laundry done, dishes done, bathroom cleaned, sofa de-dusted, vacuuming done, dog walked well, recycling out, and I ate spinach for breakfast, some granola and soy milk to recover for the ride, and then rice and beans for lunch ... but have I done any coding yet today, when I meant to have the Logoed thing finished up this morning? Nope, lol. But I've got food in me, a coffee here, and a clean apartment, which really helps me think clearly. When I'm inspired, I can galaxy-brain right through total chaos, but these days so often I have to like ... <em>work</em> to use my brain, lol. So here goes!</p>\n<p>I think I should look through how the app is right now and get the goals to get it to good enough, as well as throw in some nice-to-haves and definitely-todos, and then I can have the list in order to get this version done enough to show off the design-y bits to Dave, and then some stuff to work on to get the thing more polished for a portfolio piece, and then like the major todos for if Dave actually wants me back on the project, or to give to the devs on the project now along with the code, whatever, you know?</p>\n<p>Okay, deep breaths, some coffee, time to look at what I built with a critical eye.</p>\n<ul>\n<li>Loading. Splash screen is an ugly color with ugly text, it's not on brand.</li>\n<li>No time to read the instructions to please log in with Auth0.</li>\n<li>No Logoed logo in universal signup</li>\n<li>Header title too small, no fonts loaded</li>\n<li>Profile Creation and Just your Instagram handle should just be one thing, no need for a title (see later, maybe a title would be good,) and a please would go a long way. YourAwesomeInsta! is stupid. A blank avatar picture would help people get the idea quickly.</li>\n<li>You know, if it was half-price apps, there'd be no reason to spam, like you could just use another email and instagram account to spam for raffle tickets if you were so inclined, unless we built in anomaly detection for it.</li>\n<li>The text input is too long, and not tall enough. The gray for the placeholder and disabled button should be the same. I wonder what dark orange on the header would look like, or a linear gradient.</li>\n<li>If the whole thing was up higher, you could have just some texture down on the bottom to make it look better, and then it wouldn't seem like it was jumping so much to avoid the keyboard.</li>\n<li>It needs to remove trailing spaces, there shouldn't be any trailing spaces. Can you have Instagram handles with spaces in them?</li>\n<li>The text input outline and button color should be the same blue.</li>\n<li>The spinner should be even bigger, and spin longer to simulate the network request properly.</li>\n<li>The handle and the picture should be connected, then the prompt, then the buttons, and the buttons should be differentiated, maybe side-by-side, one blue one red or gray.</li>\n<li>This is where using the header title seems like good standard practice to follow, though again the font and font size and weight, and background color.</li>\n<li>The prompt needs rewriting and seperating, heirarchically and by font size, maybe a seperator.</li>\n<li>The sub-prompt needs to be more concise.</li>\n<li>The text input is too wide and not tall enough, and the whole list item needs to be a tap target. Tapping outside the keyboard needs to close it. Return should submit.</li>\n<li>The list needs to be recognizable as such. Maybe a border, maybe subtle backgrounds for the businesses, maybe seperators.</li>\n<li>The button for the list select needs to be again, the same color, and disabled when there's nothing there. Also maybe in-line.</li>\n<li>The scan qr code button needs to be seperated from the list, and an icon would go a long way, along with an actual button-looking-button.</li>\n<li>How about your Insta profile pic at the top left? Opening the drawer? ... nooo ...</li>\n<li>The logo shouldn't render until the camera has access permission. Don't distract.</li>\n<li>The logo isn't denoted as draggable. I think if it was put where the cameraroll box usually is, and if you could animate a glowing backlight for it either when the snapshot is taken, or the info-box icon is tapped, and make it small until it's dragged onto the canvas. Also, it should snap into bounds. Also, it should stop moving when you let go! Also it should be in the same place it was in when you take the snapshot!</li>\n<li>The shutter is crammed against the bottom.</li>\n<li>The info-box hasn't been built yet.</li>\n<li>The aspect ratio for my phone's camera means that it's going to get cropped to get posted. Maybe just have there be opaque bars indicating what part of the camera is going to be used.</li>\n<li>The message for accessing the photos is wrong, it should be so you can save your image and post it to Instagram.</li>\n<li>The Logoed image should be in the caption copy screen. The only action taken on this screen should be to copy the caption, but hammer it in: THIS PHOTO, THIS CAPTION, ENTER RAFFLE THIS WAY.</li>\n<li>Don't say please, start with the verb. Polite time was earlier, they need to do the thing now.</li>\n<li>Header title, \"Copy Caption\". Back button doesn't need to be enabled, swiping is enabled.</li>\n<li>The caption should look like an Instagram caption.</li>\n<li>I know we've had instructions on top, previously, so look this back over, but I imaging having the image, then the caption, then a big button, then the instructions would be best here, so the big button is closer to the center of the screen. Also, it needs feedback to show that an action was taken by hitting the button, not just navigating to the next screen. Like, scale, color change, tooltip, whole nine yards.</li>\n<li>No back button on the share screen. Get a visual gist, copy the caption, get the visual gist again, get the verbal instruction, off to Instagram. Header title, \"Share to Instagram\".</li>\n<li>No two buttons! We're trying to move <em>away</em> from it being cluttered. Same setup as before, gist of the post, big button, instructions. Maybe set state when you hit the botton to go to Instagram that another button shows up, and that takes you to the app drawer, and gives another opportunity for them to see the instructions, in case their drunk asses navigated away and then were like, 'whaaat?'</li>\n<li>Where's the thank you screen, hamburger menu, all that jazz, buddy? Got some work to do?</li>\n</ul>\n<p>Okay, when I start being snarky at myself, I've spent long enough in critique mode. Some of these things are like, actually majorly hard, like the flipping draggable element, why isn't it working, good lord, then there's some stuff that's legit hard but I could probably do, like the maximum aspect ratio for Instagram posts and the viewport bars, then there's some hard stuff I think I can do, like the info-box thing, though getting it <em>nice</em> could be tricky, and then there's a whole lot of easy-to-medium difficulty stuff that I can pick off as I go, oh, and I forgot everything around handling the error states ... that's a big maybe there. Okay, anyway, there's the set of things to do, at least on the front-end, and then there's describing why it's better than before, and then there's describing what would happen on the back-end ... except the video should go like, Hi, hope y'all are well, when I left off, there were some problems with the design, and I had thought the web app was the way to go, I thought of some solutions for the design and built it into a native app, which I'll show to you now, but first, I made this from like scratch in a week and learned the latest version of the screen-to-screen navigation system and this whole other pretty big structural change to the framework along the way, so thank you for the opportunity, but if there are some rough edges, please try and stay focused on the changes in design to make things easier for the user and for us to keep track of things, and secondly, there are two places where I make it seem like the app is talking to our server and doing things, but that's hard-coded in just to illustrate the user experience. I'll talk about those along the way, let's get started though. Okay, first, they've got to download the app, and the qr code should send them to the app store or google play store if everything is set up properly, or they can go to them and search for Logoed, either way, that's a little hurdle, but after upgrading my phone and seeing apps download faster, I'm not convinced it's as big of one. Moving on, I'm using the service Auth0 to sign the user in or up here, and it keeps an access token in memory for a day so they're logged back in if they open the app back up, and that's the first identifier for the user. (Moving on.) Second, we should get their Instagram handle, and then we've got everything we need to keep track of who's who and what's happening, and if we have multiple email addresses trying to be one Instagram account or an email address trying to be an Instragram account that's taken, that can be handled. Now this little verification step is the first place where our back-end would have to do something, namely get their input and go to instagram.com/whatever-they-typed-in, check if it's an actual profile page, and if it is, look for this little bit of information, the url for their profile picture, which it's not actually doing right here, I just found the url for mine and threw it in there. This should allow the user to quickly recognize they did it right and hopefully enforce the whole gist of what's happening here. Okay, moving on to the business select, and so if they're hitting the app through the qr code and have already downloaded the app and have signed in and have put their Instagram handle in, it should be able to automatically skip this part, and if you hit the scan the qr code button, it'll go through without having to even leave the app, or if they want to search with a text input or scroll down a list, there's that. This part is going to need to evolve based on the number of businesses signed up for Logoed, because you don't want a list with a thousand businesses on it, you'll want to narrow it down by location, or however that's figured out. For the moment they can live next to eachother here, and both will get you to the next screen with the right logo. Moving on, so this little pop-up is one of the major improvements, because there were like four different things going on in the Logoing screen before, we had the shutter which never went away, a cameraroll box, the logo, and instructions that never went away, and now there's the shutter, which goes away, and the logo, and the instructions kind of go away too into that little icon, which if we tap again ... will bring them up in case the user needs them, but they're more or less out of the way. You'll probably notice dragging the logo and where it's placed when you take the snapshot are a little off, but that's like probably several days of work to figure out a solution for, or a lucky guess, I don't know, I tried a few things but just wanted to get the general idea of how the flow of things could be communicated. Anyway, the next screen has just the one action, copy the caption, which we'll remember is how we can search for posts, because you can search for as many @mentions as a business on their platform as you want, but a limited number of hashtags per week or whatever, and then once you have the id of that post, you're golden and can see if it's actually of food and the logo hasn't been taken out or whatever. So, yea, this screen, you've got the image and the caption together, they should be getting the gist, and they hit the copy caption button and it tells them like, an action has been taken, something happened, caption copied to clipboard, good job, then moving on, and again, one action on this screen, you've got the image and the caption, big button, clear concise instructions, hopefully they get the idea, and it's off to Instagram. Posting ... bing ... bang ... boom ... Okay, now back to the app, here we've got a big button to confirm that they did it, or they somehow forgot what they were doing and need to go back, and here's the second piece where it looks like the back-end is confirming that the image and caption were posted properly, but I'm just hard-coding it in to illustrate what should happen, okay and so here's where they land, and we can thank them and let them know they've entered the raffle at Waffle House or wherever they are, and here they can find anything else they might need to find and we might need to include, like a feedback form, a place to list other businesses you can use Logoed at, the status of their raffle entry or maybe qr codes for half-priced appetizers, whatever their reward is, terms of service, all that jazz. Okay, so that's the gist, hopefully your team can use this, or not, anyway it's been nice working on this, stay well and best wishes, peace!</p>\n<p>Oh boy, okay, so let's see if the spash screen works ... I just made the one asset for my phone and only did like half of the Android setup because MainActivity changed ... oh, shoot, build failed ... ahhh ... anything that Xcode touches, or having to delve into any of that part of things, what a nightmare. EUGH, I have 120 errors, but none of them are from react-native-splash-screen! And they're all yellow warnings, not red errors, at least there you know what's what ... :( Okay, cleaning the build folder gave me more errors, upgrading the build target gave me less ... now I'm at 124 ...</p>\n<p>And now my .xcodeworkspace is pointing to an assets folder because I don't really know how to use Xcode, and I don't know when the last commit was, and I'm going to throw my hands in the air as far as this is concerned, fo'rizzle, until tomorrow morning when we sticky-note \"COMMIT EARLY, COMMIT OFTEN\" to my monitor, nuke the project, and rebuild from scratch! Holey moley! Maybe I'll try booting the other machine up now I have the hard drive cable, and maybe there will be <em>something</em> new and good going on. Oooof!</p>\n<p>Tell me why I have toothpicks in a clamp and a seperate pair of needlenose pliers trying to make a smaller pair of needlenose pliers though. Done, good night.</p>\n<p>Best wishes,\n~g</p>\n"}},"__N_SSG":true}