{"pageProps":{"post":{"title":"Fore Dawn's Early Light","date":"2020-04-14T06:28:04.404Z","slug":"fore-dawns-early-light","content":"<p>Good morning! I had a dream I didn't feel like having two of, so up we got! Aaand it's reading from the database time! // And updating! // And putting myself together and running with Dawa! // And making soup! Should be good! Garlic, onions, celery, broccoli, mushroom, carrot, tomato, olive oil, white pepper, tumeric, ginger powder, hot mexican chili pepper, curry powder, basil, bay leaf, thyme, oregano, salt, oh and a little white vinegar and the last of the habañero salsa. It's going to be soup for a while though, because of the coronavirus, I can't share any. 😦</p>\n<p>On with the show, though! I think I got through all of the core stuff, I'm going to plow through the rest here, and rock and roll! //</p>\n<p>Alrighty, got through some more data types and how client-side scripts go in this project, went out and mailed in some license plates, requisitioned supplies, walked Dawa again, and now I'm trying to apply for jobs, and my Internet is just <em>crawling,</em> like I've been trying to load an about page for coming up on five minutes. I applied to five jobs yesterday, I'm going to punt and try and apply for ten today ... holy crap, the footer just loaded before this form I'm trying to use, shoot me. I mean, they could use a developer, that's for sure, lol. Lol, wild.</p>\n<p>// NOPE, seven. We got seven in. Try again tomorrow. Today's been a day, between waking up mad early to code, increasing the milage with Dawa, dealing with the DMV, finding out that my federal tax return was automatically applied to student loans without my being informed, and the soul-sucking process of applying to jobs I'm pretty sure I'm not even going to get a response from, I'm done-done-donezowski. I'm going to walk Dawa, cook for him when we get back, then dive back into the Node course with the rest of my hypothetically remaining energy.</p>\n<p>/// It's the next day, I was done :\\ Best wishes! ~g</p>\n"}},"__N_SSG":true}