{"pageProps":{"post":{"title":"Golden Sky","date":"2020-05-28T08:52:10.718Z","slug":"golden-sky","content":"<p>Good morning! I'm listening to \"You'll Never Walk Alone\" after listening to The Anthropocene Reviewed earlier, and ... I'm not crying, you're crying!</p>\n<p>Alrighty, let's do it to it. // Yay all my files are finally backed up, lol. Next up is to take the hard drive out and secure the cable under it, which hopefully doesn't break it, but I have another machine, just in case, lol. Then will be \"What do I do with the Run Club project?\"</p>\n<p>So I feel like, instead of starting by making decisions about either trying to get the current code how I'd like it, take a trip back to design-land, or upgrade to React and go from there, the right way to get myself to actually do this thing rather than faffing about for eternity is to put on the business hat and walk through what actually treating it like a product I'm going to release. When I've got deadlines (balanced with applications and all the other job-getting activity,) then I'll put the coding hat on again. For the moment, let's see if I break my laptop, lol.</p>\n<p>// Yay? So I popped it open, and there was like ... I want to say it looked like mold ... in places. A) Wtf. Why is there mold everywhere here. Bleach ftw. and B) I doused the bottom cover in bleach spray ... but then a flap came off, and there was a silvery powder in thethere, and I really don't know what it is or how much damage I've potentially done. I assume it's something to do with electricity because it goes right over the battery ... Anyway, so I'm going to be watching it carefully for a while so it doesn't like ... combust ... Hmm. Either that or the glitter flakes are going to short something in there ... or it's really bad for me and shouldn't have gotten it on my skin ... I don't know.</p>\n<p>We live amongst uncertainty, though. We do what we can do, we use our best judgement, and at the end of the day there's always a certain kind of peace one can take away from Ecclesiates, chapter 9, verse 11:</p>\n<blockquote>\n<p>Again I saw that under the sun the race is not to the swift, nor the battle to the strong, nor bread to the wise, nor riches to the intelligent, nor favor to the skillfull; but time and chance happen to them all.</p>\n</blockquote>\n<p>// Hohhkay, so: no sleep last night, have kept it together pretty well here, up and at 'em at 5:15, pushing to do what I can do today ... pretty soon I have to reconfigure this thing's gatsby-node file and some other jazz so I can have some posts be part of the running tab, etc., because I was about to go on about my training plan for the next three weeks, but this is the coding section of the blog? That might be a tomorrow thing.</p>\n<p>Learned about CSP, nonces, and hashes to defend against XSS attacks. Nice! <a href=\"https://www.troyhunt.com/locking-down-your-website-scripts-with-csp-hashes-nonces-and-report-uri/\">Thanks Troy Hunt!</a></p>\n<p>Oh, boy, just did the business thing. June 22nd! Three weeks and a weekend to launch an app with three and a half years of ideation. About right, lol.</p>\n<p>Well, I'm going to table that for tomorrow morning when hopefully I've had some sleep, but I can feel it even now, when you set goals like that, they start to pull on you from the inside. Let's see how well I can balance this. Goodnight! And,</p>\n<p>Best wishes!\n~g</p>\n"}},"__N_SSG":true}