{"pageProps":{"post":{"title":"Gotta Keep It Elevated","date":"2020-05-30T12:01:06.879Z","slug":"gotta-keep-it-elevated","content":"<p>Good morning! Or midday!</p>\n<p>Ouch! Finally cut myself with my Chemex that's been a jagged nightmare on top since I broke it washing it last year. Eugh, such an uncomfortable feeling, that scrape where no scrape should be. Hwoof!</p>\n<p>Alight, let's see, I think it's time I switched over to a React frontend, honestly I just can't see myself opening those Pug files again except as a reference for a moment. The nice folks at on the Linode support team shot me a link to React with Express, though there are some super-interesting things going on right now with ... how do we say ... if React is a <em>library</em> for UI management, there are several <em>frameworks</em> that are making a big splash right now. I mean, from hearing Scott Tolynski talk about Svelte, I definitely want to check that out, too, but I just really crave some familiarity and getting some stuff done. I want to feel like I own my codebase again. I want to feel like I'm in control of my life a little again, lol. What a time ... dear reader if you're joining us from the future, there are more protests all across the country right now, in the middle of a pandemic, in the middle of a recession, and freedom and democracy are under attack.</p>\n<p>So let's push some pixels for a second, with the intent of pushing them for the forces of good, lol! (Oh, let me push yesterday's post, lol, that too ...)</p>\n<p>Eugh, so I couldn't ssh into the box after not having touched it for a month, who knows, I didn't do anything crazy on it, so I'm just going to rebuild it and go through setting it up again. It's like ... fullstack is weird like this, either I'm thinking about colors, icons, typography, and nudging pixels around, or I'm thinking about data flow through on the client-side and all that frontend engineering stuff, or I'm thinking about nginx and ports and iptables and <strong>really</strong> not knowing what I'm doing, though better than a few years ago, lol.</p>\n<p>Had to search through my papers to find the password ... definitely still getting organized here. I've definitely made more progress in the past week on that. When my brain stops working this afternoon that might be the filler task. Ooo, speaking of, though, the laundry is probably ready! A check cleared today and I could finially do my laundry again. Never a dull, as my mother would say :)</p>\n<p>Lol, I wonder if I can work on design, frontend dev, and backend dev at the same time if I go like 10 minutes with one, then the other, then the other ... Okay, that's the plan, and I'm going to figure something out so I can document ... the ... lol <strong>IF ONLY</strong> there was a place I had to write out my process for future reference! (website points at self)</p>\n<p>It's nice to have a dedicated docs for each part though ... tomorrow early!</p>\n<p>Best wishes!\n~g</p>\n"}},"__N_SSG":true}