{"pageProps":{"post":{"title":"Hit the Ground Running!","date":"2020-05-21T08:15:13.444Z","slug":"hit-the-ground-running","content":"<p>Gooood morning! It's been exciting already! Including bathtime for Dawa! Keeping everything clean and myself sane has definitely been a challenge, I think I'm doing pretty well though! Dawa got his bath, it wasn't too too strenuous for him, we got a short run in, same, I got my spinach and vitamins in with my first coffee, got a little gluten-free granola with fruit and nuts and soy milk, about to make another coffee, Dawa's chomping on a bully stick, I'm like put together by a reasonable hour this morning, got a little bit of a workout in ... yea!</p>\n<p>I need to get this thing backed up, and I need to get Run Club finished and launched, lol. I keep on wanting to do other things, which I should totally do, but like I was thinking through various projects, a voice in my head said, \"... but is your box backed up?\" to which my other voice responded, \"... Right.\"</p>\n<p>// Okay, walked Dawa <em>one more time</em> this morning, it's like an hour later. Whwoo-boy.</p>\n<p>I think I was still backing up my dotfiles. Super nice out, working outside! Got some crudites going ...</p>\n<p>Whoa, todo!! I don't have automatic https upgrades on my website! Whaaat.</p>\n<p>// Lol, so my laptop was going slow, and I've got two browsers and Spotify open, but still, and then I realized I'd plugged it in and had turned Folding@Home on full power ... ahh! Got it! Full is 4 cores, medium is 3, light is 1, sweet. Just discovered visualization options, too! Fan's on ... hmmm ... going light mode, have a tile under the front of the computer, screen all the way down etc, see if it stops ...</p>\n<p>I think I'm going to try Firefox for a bit. I like Brave, but I'm always running into things not working, and I wonder if Firefox and me are ready for eachother, lol. // ... after a bit, I'm not sure. I feel like more of my data is going to facebook, I keep seeing it pop up ... maybe it's what I'm doing?</p>\n<p>Alright, to the future! Best wishes!\n~g</p>\n"}},"__N_SSG":true}