{"pageProps":{"post":{"title":"Lemonade","date":"2020-08-09T05:39:42.946Z","slug":"lemonade","content":"<p>GOOD MORNING! I got like an hour and a half of sleep last night, and the coffee definitely has not hit yet, but my day light was set for earlier than yesterday, I'm up, let's do this!</p>\n<p>Huh, I thought I fixed photos ... oh, wow, my Gatsby config file is <em>all</em> messed up, there's nested plugins declarations. I don't know how it builds at all, lol. Good job, Gatsby, and Gareth, what the hey? Okay, I need to prioritize, though, omg and Dawa just stretched lying on his side he's the cutest ... ahem! Prioritize! Gatsby config file gets turned into an issue, let's get this React written. Go!</p>\n<p>Oh, no, Dawa is awake and needs attention for the next two hours, lol. Effff.</p>\n<p>/// Okay, yea, handled. Woof. I don't know what I did, but images are back up. Posts with images, so far, if you want to catch up ... not sure how long images hasn't worked, lol:</p>\n<ul>\n<li><a href=\"http://garethfield.com/proudfoots/\">Proudfoots - August 8th</a></li>\n<li><a href=\"http://garethfield.com/index-and-layout-and-blog-post-oh-my/\">Index and Layout and Blog-Post Oh My - August 6th</a></li>\n<li><a href=\"http://garethfield.com/rock,-roll,-repeat/\">Rock, Roll, Repeat - August 5th</a></li>\n<li><a href=\"http://garethfield.com/oh,-hey-past-me,-thanks-for-the-note/\">Oh, Hey Past-Me, Thanks For The Note - August 2nd</a></li>\n<li><a href=\"http://garethfield.com/floor-space/\">Floor Space - July 22nd</a></li>\n<li><a href=\"http://garethfield.com/overcaffeinated/\">Overcaffeinated - May 29th</a></li>\n<li><a href=\"http://garethfield.com/sweet-word-cloud-bro/\">Sweet Word Cloud Bro! - May 24th</a></li>\n<li><a href=\"http://garethfield.com/sunshine/\">Sunshine - April 28th</a></li>\n<li><a href=\"http://garethfield.com/super-cereal/\">Super Cereal - April 26th</a></li>\n<li><a href=\"http://garethfield.com/yet-another-day/\">Yet Another Day - April 3rd</a></li>\n<li><a href=\"http://garethfield.com/z-day/\">Z-Day - April 1st</a></li>\n<li><a href=\"http://garethfield.com/everything-black/\">Everything Black - March 30th</a></li>\n<li><a href=\"http://garethfield.com/dahmbeyhrgeyhr/\">Dahmbeyhrgeyhr!! - March 26th</a></li>\n<li><a href=\"http://garethfield.com/the-space-between/\">The Space Between - March 20th</a></li>\n<li><a href=\"http://garethfield.com/back-up/\">Back Up! - March 18th</a></li>\n</ul>\n<p>Ayy, applied for a job! I hope they get back to me! Ooo, and the person I emailed said they would pass my name along to someone they know, very exciting! Yay for not appearing outwardly crazy to the other people at the dog park, lol!</p>\n<p>Two jobs! Ha! What's the next thing to work on, I need to get the laundry in, myself together, and Dawa outside for a bit. Might work from the dog park. Headers logic. This may be overkill for a button, it's going to be awesome though, if it works out, I'm so stoked if I can pull this effect off.</p>\n<p>// Okay, Dawa walked, albeit briefly due to the heat, laundry should be done soon, and let's see how close we are to this thing rendering ... query in blog-post template ... uh-oh, I fixed a few things and it built. I wonder how awful it looks right now, lol. Oh, sweet, now the errors are just showing up at run time. <code>socials.map</code> isn't a function, cool, can handle, forgot that's an object, not an array, wrong data type</p>\n<p>Oooh, that was confusing, it was telling me data was undefined for the default export of index.js, but the actual problem was that I was importing { Image } from gatsby rather than Image from gatsby-image. I saw a flash of bi pride before it collapsed this time! How exciting!</p>\n<p>OH WOW! Guys! Guys come quick! It rendered! It's so awful lollll!!!!mjhgkjhg</p>\n<p><img src=\"/mobileBad.png\" alt=\"Mobile bad\"></p>\n<p><img src=\"/soBad.png\" alt=\"Wow, so bad\"></p>\n<p><img src=\"/fullGlory.png\" alt=\"Full glory\"></p>\n<p>It's rendering though!</p>\n<p>Unfortunately, lack of sleep has caught up to me. I'm going to do everything I can to stay up another few hours here and make sure Dawa has enough outside time ... except for drink more coffee. I had two cups today, and I think going off my caffeine schedule yesterday may have contributed. Also I got just way too excited to see my sister and her fam, and then had an emotional breakdown at like midnight, lol. I was going to say maybe I'll get more work done today, but I know when not to push myself, at least sometimes.</p>\n<p>Best wishes y'all,\n~g</p>\n"}},"__N_SSG":true}