{"pageProps":{"post":{"title":"Low Cool","date":"2020-07-20T17:25:34.709Z","slug":"low-cool","content":"<p>It's about right for mid-July, holy moley though, let's not with the ninety degrees.</p>\n<p>I got like two thirds of all the papers sorted today. I decided what the categories were going to be and which went where, then took all the papers out and lined them up in piles, and decided to work from left to right. I've got an extra table in from the patio and had the long table cleared, and had both filing cabinets the the desk emptied and the top of the desk cleared, and 'work' was going to go on the desktop, 'official' in the desk on the left hand side, 'personal' in the desk on the right hand side, 'archive' in the white filing cabinet, 'questionable content' in the brown filing cabinet, as in, \"do I need to keep this or document its existence?\", and the green filing bin for anything I'd want to bring out in case of a fire. Plenty got thrown in the trash, and I'm just about there with seperating it into categories, but a lot of it was about Mom, too, so I was like barely able to get through the day with just one breakdown, lol. Actually, it was about Dawa, too, though just the whole 'death' in general theme. We only did a mile this morning because my knee was hurting and I wanted to cut it short, so like all the attention he got today was, well there was the last walk, which was pretty short because it's so hot out and nobody is outside, not too interesting, then a short one earlier in the afternoon, that mile before, and we got some grooming in before we left, and our first walkies. New brush today, too, I used the other one so much the little brushing bits were coming out. The new one feels cheap, I'm probably going to have to replace it, but if I don't do it again as part of tomorrow's routine ... I'm so close to keeping him mat-free. I think the next web project I want to work on is a Dawa-tracker, because we've gotten bike rides to different places all the past like six days in a row I think, hold on ... ok, so the 13th I didn't run him, but the 12th I took him to Bluff Point ... eight days, seven runs, five locations. Yea, doing pretty good at the moment. I wonder if I could have it include the distance biked, I haven't used the Google Maps API in a while, and I'm not even sure route-finding is part of it at all. I wish I could jump into the next activity with manic fervor here, but I'm wiped, the place is feeling heckin cozy, and I've got a todo list that can be started early tomorrow. Mañana. ~g</p>\n"}},"__N_SSG":true}