{"pageProps":{"post":{"title":"Mend It Monday","date":"2020-04-06T10:42:01.234Z","slug":"mend-it-monday","content":"<p>I gotta say, after yesterday, I'm <em>rocked,</em> I haven't felt like this in a while ... feels good, man.</p>\n<p>Okay, so, big phone call today, or Google Hangouts session ... in the hangout, going to try to match the verbiage ... anyway, could be a big day, though the way I see it, there's a very small chance that I actually get this job, a decent chance I get flat-out rejected, and a pretty good chance I get some sort of a nebulous answer of either maybe a second interview or a we'll call you back, maybe, so I've got my resume, I know a few places where there are some job listings, and I'm going to get done with the Logoed thing and move on to this site and Run Club so that the resume will even be accurate, lol, because it says I'm working on those two currently.</p>\n<p>Now, what I <em>should</em> do is take the Pluralsight courses on Git and learn it properly, then dive back in, but what I'm <em>going</em> to do is make a commit with everything broken, now, look up how to go back and forth between commits properly, make a new branch 'fix-it', and hop back and forth and do my best to get everything working <em>today</em> so I can a) bring my confidence back up before this <del>meeting</del> hangout, and b) move on with my life.</p>\n<p>Oh, <strong>Thursday</strong> ... oof. Where are the sticky notes ... there, I've done it, first sticky note on the monitor since moving, \"Commit early, commit often!\" Will I learn? Who knows.</p>\n<p>Oh, wow, though, the top answer on StackOverflow just described checkout, diff, and merge so clearly though ... How haven't I seen that before? Or maybe I have, but now I've done enough to know what they're saying ... hmm ... 83ff97fe22640fb4db97cff1c442626ce4708256 is Thursday's commit ('it went boop!') and b973cc9d65455256bd669a79bd0e0dc0815809cf is today's commit ('I broke everything') ... whoa ... okay, so, yea, just read through git diff --help ... what was much less scary than last time I remember reading any git man pages. Okay, so git diff commit1 commit2 === git diff commit1..commit2, you can use --name-only or --name-status to get just the file names/names plus statuses, and you can tack on either a file or directory and it will either do the file or any files in the directory. Cool! Or git diff HEAD^ HEAD for the version before the last commit and the last commit, which is what I want ... okay, so I think package.json, then /ios, /android, and /src ... ooh, I added cameraroll ... do I even use that yet? Yes! That saves it to the cameraroll, I was thinking the imagepicker. Oh, cool, I can just do git checkout HEAD^ ...</p>\n<p>Okay, it's a start, adding @react-native-community/cameraroll, deleted a .xcodeproj/ that randomly showed up, so (cd ios &#x26;&#x26; pod install) works again ... waiting, lol ... did I update the permissions in info.plist yet? I needed to change that, anyway ... oh, I can't checkout another branch while that's running, lol ... No updates, oh this is <em>cool!</em> // Oh, that took <em>way</em> less time than I thought it was going to! That took like an hour and fifteen minutes, all told.</p>\n<p>Sweet! It built! And it's still buggy, but it's not <em>that</em> type of buggy! Dog-walking time!</p>\n<p>// AAHHHH!!! Interview! Interview went well! Okay at least! I lived through it! Omg! First off, they're super-legit, like no kidding, wow. That I was in way over my head became apparent (hopefully more-so to me, lol! ... maybe not though, also lol) <em>very</em> quickly when he started talking about who was in on the project, both personel and company-wise. Wow though! And so I introduced myself, and I think I forgot to give like any color at all ... well, that's not true, I mentioned how the unpaid internship at Moodbit was like ... wake up at 3:30, walk the dog, bike to Starbucks and open up at 4:30, work till 12, then bike to the train station, take the train into the city, code till like 6, rinse, repeat, and how the Logoed project ended :(, and that I liked orchids, which apparently the non-technical founder does too ... but so the coding challenge part, I was like, sooo nervous, omg! He was so nice though, especially because you could tell he was like, trying to get through it and waiting until I stopped talking for a little before nudging me in the right direction ... that was the wooorst though, omg! I didn't remember the do-while syntax, so I used a good ole for loop ... ahhhh, so not functional! And then I forgot to call the function I wrote, that was soo embarassing, and I called i++ within it, omg ... nightmare material ... at least I started it off with a little joke though, the challenge was to print to the console the next thirty leap years, and at least I remembered how to use the modulus operator, and at least I got there, <em>eventually</em> lol, but so I started by typing out console.log(2020); console.log(2024); console.log(2028); and was like, probably not like that, right? Which I hope he found amusing :) Then I was able to ask him some questions and it was like, BOOM! Guess where'd this come from, who's interested, who's working here, and I was like oh, jeez, well, nice interviewing with you, <em>but not out loud</em> lol, and so I'll hear back either tomorrow or Thursday! AAAHHHHHHHH!!!!!</p>\n<p>Best wishes!!!\n~g</p>\n"}},"__N_SSG":true}