{"pageProps":{"post":{"title":"Proudfoots","date":"2020-08-08T08:39:19.404Z","slug":"proudfoots","content":"<p>Lol and good morning! Got Dawa out on a trail run again this morning, just having my second cup of coffee before putting myself together, and I really want to solve the header problem really quick because I was thinking about it trying to fall asleep last night, but really quick, I just saw this commit message, <code>Add a footer so that content does not abruptly end</code> and that makes so much sense!</p>\n<p>Okay, so MoreLessButton is going to be floating between the headers, meaning it's going to be absolutely positioned and needs to know how many headers are open at the time, and then if the user closes any headers, start saving state to localStorage so they don't have the headers open next time. Forgot to mention check if there's ... what are we calling this ... headersCount? headerCount? Names are hard! Okay well it's counting headers, but you count pages, too, but you don't say pagesCount, you say pageCount, it's implied by count that page may be plural.</p>\n<p><code>headerCount</code>.</p>\n<p><img src=\"/fortTrumbull.jpg\" alt=\"View from the Fort Trumbull entrace\"></p>\n<p>// Alrighty, coding from Fort Trumbull! I've got half an hour or so before Elsbeth and co. are supposed to be here, so I can ... oh back, please cooperate. Th kinda works if I don't really look at the screen, or use just my eyes, but it's so tempting to lean forward ... which I can do if I'm writing in English, I don't know about JSX though.</p>\n<p>Got the header situation handled, I've got some coffee here and just wrote an email ... phew, sent, nice, I think I used words good ;) How 'bout some JavaScript baby, yea! Made some coffee, it's kicking in here, lol.</p>\n<p><img src=\"/patioDesk.jpg\" alt=\"Current desk arrangement\"></p>\n<p>Oh, lordie, just went down the FP rabbithole for a while. <a href=\"https://medium.com/javascript-scene/curry-and-function-composition-2c208d774983\">Currying and Function Composition by Eric Elliot</a> Then my back said no more sitting. I took Dawa to the park for a bit, I'm trying lying prone and seeing if I can do that. I just read a compelling argument for not just combining state and using the functional version of setState with a spread operator, recommended in the docs and all that. I think that refactor is going to have to be for tomorrow, though, I'm zonked. The alarm is set for earlier, let's see if I can get Dawa ran and coding before 8! If there are dogs at the park when we get out from the trail-run, though, it's going to be 8:30.</p>\n<p>Tifme to wind down, though, peace and &#x3C;3, best wishes,\n~g</p>\n<h4>Footer .. heh ..</h4>\n<p>The title and description are references to Lord of the Rings, the movie, first in the trilogy, not sure exactly why that bit came to mind, but I don't have these sorted by date, and having a memorable name is the only way I can find it quickly. Eyes are weird.</p>\n"}},"__N_SSG":true}