{"pageProps":{"post":{"title":"Rainbows, Check ... Butterflies, Check ...","date":"2020-05-17T10:54:10.222Z","slug":"rainbows-check-butterflies-check","content":"<p>Good morning!</p>\n<p>So I'm trying to wrangle my hard drives here, and I think we've got a 500, 250, and 160 here ... the 160 on the other machine is giving me trouble, and I just found an archive from like ... I don't even know, actually, let's see ... 2016 ... and I'm trying resetting the PRAM etc to get it to see the bootable USB again, that was the problem last time, right? I just would rather have ... well rather see the thing working again and then we can talk about backups. Dang'd booting these things up and seeing the blinking file icon with a question mark inside. Yay it's going!</p>\n<p>Okay, and so while I wait on that and let what to do about this backup from 2016, I might have all of it in Google Drive already, am I going to search file by file? Why is it there?</p>\n<!-- Anyway, _while that marinates,_ I **met** someone today! I am super in work mode right now, but I'm **very** excited and hope to become very good friends with them! Deep breaths, though, and why didn't booting from the USB work, lol 😃 -->\n<p>Why didn't booting from the USB work, lol 😃</p>\n<p>Oh, okay, the folder 250dump, that's what that means ... so if that's backed up already ... oh, and the USB did work, I just needed to run install, classic. Gooooood morning! Another cup of coffee is possibly called for. I've got to slim this drive down though, node_modules, media, all that ... //</p>\n<p>Mmm, coffee. Handled some financial stuff, that's off my mind now ... oh, wow, good amount of stuff to delete ... fastest <code>node_modules/</code> hunter in the East, lol ... so I had 180gb used? How low can we go? Ohhh, it's still going, lol ... took a shower, still going ... we're at 731,514 deleted ... okay, sweet ... media on its way to being cleaned up ... 159gb already though, that's nice ... nooo, being logged into the wrong wifi finally bit me! That's okay, just some time ... oh, yay, go Google Drive uploader go!</p>\n<p>✨ 155gb! ✨</p>\n<p>Wow, sooo much of that was node_modules folders. Crazy. Now let's try the backup thing ... 21 minutes, cool ... I'll clean up some Run Club stuff ... uhoh, are you frozen, Time Machine? I'll give it to the top of the hour, lol.</p>\n<p>// Ahh, so frustrating! I'm about to say forget about Time Machine, and I'm just going to back everything I need to back up on cloud services and be done with it! One more try though, it says 104 seconds ... the smell of my green tea fills my nostrils, the hair on my legs stands up, I straighten my back up ever so slightly ... 38 seconds ... luscious music plays in the background ... 14 seconds ... the tension is in the shoulders ... wrists, neck, preparing backup ... ... what if saving this file while it said preparing backup broke it? What if ... I deleted some stuff I wrote here, it's hard to get tone right in print, but I was going for a descent into madness type deal. Okay I'll give it to 3:30, then I'm shutting it ... JOY! What a rollercoaster day, lol, and now sadly I'm falling asleep at my desk and am going to bust a mission here ... ehh, maybe in a minute, I want to keep going.</p>\n<p>Ooo, now I know the gist behind git-flow, yay, I'm going to use source control differently now! I've got the cheatsheet from <a href=\"https://nvie.com/posts/a-successful-git-branching-model/\">nvie.com/</a> in my folder! Thanks @nvie! Oh, wow, actually go follow him, that's Vincent Driessen and he's got a lot of great work!</p>\n<p>Okay, <em>now</em> I'm going to get going, because it's saying the next automatic backup is in eleven minutes, so hopefully ... know what, no 'hopefully', auto backup off, I'm going to go and get beer before they won't sell it (blue laws! Who'd a thunk?!) and we'll see if the file deletion is done yet when I get back! ... ohh, I knocked the disk ...</p>\n<p>Supplies requisitioned, dog walked again, food on the stove for dog, and I really thought this Time Machine thing was going to happen but now I'm really not sure it is. My back hurts, and it's time to stop myself here. Tomorrow's Monday! Work-type things are expected to be happening! The proverbial hammer just fell, too, very exciting week! Ask me about it over coffee! For now!:</p>\n<p>Best wishes!\n~g</p>\n<p>P.S. Keeping on going, lol ... must ... get up and running ... lol <em>everything's</em> breaking now, this is crazy.</p>\n"}},"__N_SSG":true}