{"pageProps":{"post":{"title":"Special Star Sticker","date":"2020-04-20T10:34:08.111Z","slug":"special-star-sticker","content":"<p>Good morning! Got a workout in today, and got Dawa out for a short run, just 1 mile. I gotta say, doing a workout in my apartment is like, not my favorite thing in the world, but I've got to get in shape, and I <em>do</em> feel better afterwards. Now that the blood is flowing, time to debug. I wrote way too much code without testing yesterday. Whoops! This is one of the reasons I really need to exercise, though, if I haven't, I can get in this rush where I feel I've got to go a million miles an hour and cram as much productivity as I can in, when in reality I need to hold my horses, put on my thinking cap, and cultivate the part of my mind thinks <em>slow.</em> (Highly recommend Daniel Kahneman's <a href=\"https://bookshop.org/books/thinking-fast-and-slow/9780374533557\">Thinking, Fast And Slow</a></p>\n<p>On with the show!</p>\n<p>// Jeez, Louise, <em>that</em> only took an <em>hour</em> ... I forgot to append <code>enctype=\"multipart/form-data\"</code> to the form, that's why there was no <code>req.file</code> ... eugh, not used to having seperate files for views, lol. I miss React. Thought I was going totally bonkers there. Ok, with it then! ... And yay! Just had to change two route names, and it all works perfectly, password reset and all! //</p>\n<p>Fun! AJAX requests, API endpoints, and defence against XSS attacks! Only like two hours left of course material, and then I get pushed off the dock, as it were! Must rest, though, lol, let that sink in, then I'll reapply it to the other project. Have to go through more potential job applications, too, it's like that early afternoon slump where that's all my mind is good for, more or less. Pretty stoked for cooking dinner later, too, I'm going to do some stir-fry, beans, and rice.</p>\n<p>// Huh, so, totally had an adventure today, and my soul is replenished for tomorrow, but I'd pictured getting more work done after, had this whole plan, no way though. Not happening. I'm definitely like alert and with it at the time that I'd planned to be alert and with it, because tomorrow at this time I've got an interview (yay!) but it's an hour to the trail, ran for an hour, reinjured my ankle, lol, totally worth it though, and an hour back, and my everything hurts, sitting in this chair is done in like T-minus ten, and I'm not even going to cook dinner, I walked Dawa, made him dinner, and I'm going to sit with a book until Dawa gets me to take him out again, and then I'm zonking out. Supposed to rain tomorrow, anyway. The beans and rice and stir-fry can happen after the morning coding sesh, and they'd better because I have no other food now, lol. Goodnight!</p>\n<p>And best wishes!\n~g</p>\n"}},"__N_SSG":true}