{"pageProps":{"post":{"title":"Strings!","date":"2020-05-07T12:20:05.123Z","slug":"strings","content":"<p>In which strings, but first tabs! So many tabs open!</p>\n<p>Ooo, I should include the description in the start of the post more often, as if you go right to the link you don't see it, but it's definitely part of like the theme!</p>\n<p>Googleing the options for autoCompleteBrackets, why on EARTH did I have it on \"never\"! I don't know what \"languageDependant\", which of course hope to find out one day, but I went \"always\" for now!</p>\n<p>Prettier config ... oh my God, the guy next store is singing and ffaaeeeeeeeeling it! Hoo ... hooo-boy. That was also the case at like 4 in the morning, when I decided to get up, which is how we got to me starting this post in just the early afternoon with just 'Strings.' Lot going on in code-land though, lol. Can't wait to chop up some JSX and make some libraries work again. This is not coming as easily as I thought. The next thing I learn, I need to a better job with taking it in. I think the standing desk, it's <em>possible</em> to get more productivity, good creative work though, I don't know, it'd have to be on a good back pain day, lol. Anyway, prettier config, like which is spaces between brackets and arguments? That's a later thing.</p>\n<p>Next tab's question can die, and then I'll hear someone use the word, and I'll be like aha! In episode 454 ..!</p>\n<p>Mongoose query methods have a .lean() that might be what you want depending on how your query is structured!</p>\n<p>Oh, pulling and adding to set in MongoDB, it worked before when it was just strings, and running .save() when you can is recommended, n'est pas? Twelve tabs for this. This is why \"Strings.\"</p>\n<p>I'm going to make another sticky note. I've got \"Commit early, commit often!\", \"Const till you Can't!\", and now I'll have \"Add cursor to all instances of current selection|: Cmd + Shift + L Selection| meow!\" Nice.</p>\n<p>Aaand GitHub Issues, right, that's where I have to start putting a bunch of stuff for a 'later' category, as it gets ready to be fleshed out and made all nice. Okay, and then I've listed out all the code, at least the controllers, haven't hit views yet, and haven't fleshed out all the routes, actually, either, like, yea, no, there is no /runner/:id, what, crazy. I collapsed all of the code chunks in all of the controllers though, we're gonna get <em>organized!</em> Also we've got runner-, user-, and authControllers, and Run.js and User.js are the models, so maybe we can do something about that, but remember we can't just do a project-wide search of User and switch it to Runner, definitely not with node_modules installed, lol. Doh. Not making that mistake again.</p>\n"}},"__N_SSG":true}