{"pageProps":{"post":{"title":"Strikethrough Before Dawn","date":"2020-05-18T06:11:01.231Z","slug":"strikethrough-before-dawn","content":"<p>Good morning! Up early today, 4, goin' ham today!</p>\n<p>So in episode six hundred and seventy five of Gareth is a silly goose, I thought Time Machine <em>compressed</em> the data it was backing up, but it takes more, so of course I can't use the smaller drives to back up the bigger one, and actually the middle size drive seems to be crashing both machines when I plug it in, so I don't know what's going on with that, but I'm going to get my second machine up to parity, put everything under source control, then I'm going to shore up the main machine so the hard drive cable doesn't break, hopefully, and then I can be done with the backing up project for the moment, lol.</p>\n<p>Btw check out <a href=\"https://foldingathome.org/\">Folding@home!</a> You can help fight Coronavirus and it gives you a sweet visualizer!</p>\n<p>Ah, for the record, if Android development is help up again with debugging from device, I think Chrome instance 2 auto-updated from v45?</p>\n<p>Yay the machine is working, though, lol.</p>\n<p>//\n<span id=\"podcast\"></span>\nWhat a rollercoaster of a day! I'm probably not going to talk about part 2 at the moment, but wow! (Good things mostly.)</p>\n<p>Back to tech though, most of the software is onto the other computer at least, and I was about to start some <code>git clone</code> action goin' on, when like, day part 2 happened, but so that also included a walk with Dawa where I listened to <a href=\"https://devchat.tv/js-jabber/jsj-431-personal-branding-for-developers-with-morad-stern/\">the JavaScript Jabber podcast episode 431 with Morad Stern, Personal Branding for Developers</a> and took notes, and so here's them again so I learn them better ... thanks brain! :)</p>\n<p>Personal Brand: just think, \"what you think of when you think of [persons_name].\"</p>\n<p>Platform #1 Where devs talk: Twitter. (Go Reactiflux though!)</p>\n<p>Dan Abramov might have 240,000 Twitter followers, but he wasn't born with that, and would you hire Dan Abramov? (( Absolutely. ))</p>\n<p>It's never too late, the various digital assets, LinkedIn, etc., should be done in the good times, not in an emergency. (Put in time here, may be behind)</p>\n<p>The How: Tooling!</p>\n<ul>\n<li>Scheduling! 1hr/wk min<ul>\n<li><ol>\n<li>mapping: territory: frontend/fullstack : terms associated : thought leaders: dates of events and releases in the industry</li>\n</ol></li>\n<li>Accurate mapping : highest value</li>\n<li>It comes from your experience, what you know, and that's the link to:</li>\n</ul></li>\n<li>Content</li>\n</ul>\n<p>Blog posts, podcasts, youtube, and you can post on twitter/linkedin ... how to share ....</p>\n<p>Busting myths! \"Everybody knows what I know.\" No!</p>\n<p>\"Blog Your Journey\" :)</p>\n<p>Soft skills practice!!</p>\n<p>Potential employers look at GitHub stars and views etc.!</p>\n<p>Being part of the community, ! FAME ++ COMRADERIE! MAKE AND IMPACT!</p>\n<p>Always be bringing value!</p>\n<p>It's like having marketing before a sale (product vs. hire ✅)</p>\n<p>Platforms - Online / Offline</p>\n<p>Reminder: Dev lyfe 'bout learnin'\nContent 'bout learnin',\npractice! Make and make it look good!</p>\n<p>Offline : Meetups : Talks! (Now online, lol!)</p>\n<p>\"Here's what I know!\"</p>\n<p>Tweets<em> happen from these! </em>etc</p>\n<ul>\n<li>\n<p>Scheduling // \"Whatever you do, in the beginning, you're not going to break the Internet.\"</p>\n</li>\n<li>\n<p>Mapping</p>\n</li>\n<li>\n<p>Hit the gas! // Practice consuming good content too!</p>\n</li>\n</ul>\n<p>... ... ... aaand that's where that and this post end for the moment, should come back to this and turn it into paragraphs and a blog post though (and put it on LinkedIn, lol.) Ciao, and:</p>\n<p>Best wishes!\n~g</p>\n"}},"__N_SSG":true}