{"pageProps":{"post":{"title":"Super Cereal","date":"2020-04-16T10:22:07.128Z","slug":"super-cereal","content":"<p>Oooh, <em>this</em> is fresh! Search 'city pop' on Spotify!</p>\n<p>Alright, Dawa and I got in nine and a half miles at a pretty good pace there, hence the title, but now I'm going to get super cereal up in here!</p>\n<p>Spent just a moment going over a free landing page template built in React from <a href=\"https://github.com/cruip/open-react-template\">Cruip</a> that was on HackerNews, just to get my head into coding mode ... pretty good stuff! Definitely going to keep it around as a reference!</p>\n<p>What was I doing? I picked out some fonts, and I should just pull over the icons from the other project and throw them in there, and try and get this thing up and running. 🏃‍♂️</p>\n<p>// Just get the fonts, colors, and icons up, he said. Quick task, he said. Hundreds of lines of code later ... Oh well, strong attention to detail in front-end code. That's what's gonna make the bread. Oooh, speaking of food ... okay, another fifteen minutes, then I put some soup on.</p>\n<p>// ... OOOHHHKAY wtf. Having one of those days where I felt pretty good and like I was going to make a lot of progress, and I'm running into weird bugs trying to get the flipping thing to just not give me any errors in the console. I went as far as to just copy-paste the whole dependencies/dev-dependencies from the other package.json, since bringing mongoose back down solved one bug, and it did solve another bug, so it's all bundling into dist now, but it's changing the headers of the request after received from the client and it's complaining? I'm cloning the whole darn project again and trying it, maybe it's ... I don't know ... rough day, lol.</p>\n<p>// Dog is walked again, dog is fed, project is broken and I have no idea why, and here's the plan: commit the code, new branch, nuke it, copy in the starter files, add the stuff I added, see when it breaks, or if it breaks, go from there. Go!</p>\n<p>... God damnit. I just deleted all of my work from today. Okay, welp. Take two. 🎬</p>\n<p>OH NO! EVERYTHING WAS STILL IN CACHE IN VSCODE AND THEN I BLEW <strong>THAT</strong> AWAY! I'M A FULL-BLOWN IDIOT! 😢 FUCK! // AND I WAS ON THE MASTER BRANCH WHEN I MADE ALL THE NEW CHANGES! AHHHH!!! ... AND THE REACT BRANCH WAS OVERWRITTEN. WHAT.</p>\n<p><a href=\"http://www.youtube.com/watch?v=v74-0GON0go\" title=\"What The Fuck\"><img src=\"http://img.youtube.com/vi/v74-0GON0go/0.jpg\" alt=\"Nichijou Shrine Incident\"></a></p>\n<p>... and Dawa needs to go out again. What. The. Fuck. Shoot me.</p>\n<p>// OKAY ROUND WHATEVER, GO</p>\n<p>I don't even know where to start right now ... fonts?!</p>\n<p>Done, I'm done. Donzowski. Today doesn't go down as a good day except that we absolutely did get that run in, and I'm going to set my alarm for early tomorrow, hopefully I get some sleep tonight. Oh, actually, you know what? I totally booked another interview, I keep on mentally glossing over that, it's like big news though. I'm going to put in my two weeks at Starbucks before that though, and I'm frankly just scared and bitter and all sorts of negativity right now.</p>\n<p>Cereally, best wishes though,\n~g</p>\n"}},"__N_SSG":true}