{"pageProps":{"post":{"title":"The Space Between","date":"2020-03-20T07:52:03.284Z","slug":"the-space-between","content":"<blockquote>\n<p>The space between ... the tears we cry is the laughter keeps us coming back for more ... the space between ... -- Dave Matthews Band, \"The Space Between\"</p>\n</blockquote>\n<h2>The Problem</h2>\n<p>So I've got an idea for a layout for my landing page, seems pretty simple, there's already a header, then a 'bio' component, and a footer, and I want to have a nav bar that works like tabs and a space for the main content fill up the remaining space, with the whole thing taking up 100% of the vertical space of the screen, so like only that main content part being able to scroll, at least on desktop and tablet.</p>\n<p><img src=\"/the-space-between.jpg\" alt=\"Simple diagram of the desired layout\"></p>\n<p>So what's the big deal? Height of the screen is easy, <code>100vh</code>, then just subtract the height of the header, bio component, footer, account for any padding, bada-bing, bada-boom.</p>\n<p>Not so fast, cowboy! Maybe there <em>is</em> a simple solution and my CSS skills just aren't what they need to be, but googling it pulls up a lot of results for when the heights of the other elements are known or can be easily calculated, and if I'd rolled all of this myself, I'd be able to add it up simply, even accounting for changing heights based on font sizes with the <code>rem</code> unit, but I used <code>gatsby-starter-blog</code>, which has been great, but like the first h1 tag has <code>font: 106.25%/1.45</code> and <code>line-height: 1.15</code> and ... wait ...</p>\n<h2>The Solution</h2>\n<p>Well, the solution ends up being, I think, that I'm an idiot and didn't see that literally every bit of height, margin, and padding in this whole arrangement <em>is</em> based on the <code>rem</code> unit, and like three minutes of trial and error is going to get me were I need to be. I was about to do this whole thing with <code>react-sizeme</code>, which is a library that gives you something like element queries, which isn't a thing yet, but because the index page renders the layout component that takes in children as a prop, and only part of that needed to be sized, based on its siblings, but also based on the other components in 'layout', it was going to be this whole thing.</p>\n<p><img src=\"/galaxy-brain.jpg\" alt=\"&#x27;Galaxy brain&#x27; diagram\"></p>\n<blockquote>\n<p>\"You're the dumbest smart person I know.\" -- Dave Crump</p>\n</blockquote>\n<p>Yyyeap, 14.2 was the magic number. Why not 17.825 or 20.65343? Great question. There's 3.625rem missing in my calculations somewhere, but now we have new challenges! Yay! Oh, actually, there's a whole <em>other</em> 3.625rem missing, too. What in the what. Oh wait, no, subtraction, I found the initial 3.625rem, lol.</p>\n<h2>Moving On</h2>\n<p>Hmm, so there are solutions for having the scrollbar always be visible with the ::-webkit-scrollbar:vertical pseudoelement and pseudoclass ... <a href=\"https://codepen.io/stevenlewis/pen/hubpL\">Steven Lewis' CodePen on it</a> ... which we're going to leave for now, and revisit when I have more content.</p>\n<p>Okay, wow, coming along! Wonder how it looks on mobile, lol. Oh, jeez. So the header wraps a line and blows away the math I did, and the -px to the left that I used to create the two key lines sends it right off the screen, but one thing at a time here.</p>\n<p>Oooh, todo: credit <a href=\"https://css-tricks.com/overriding-default-button-styles/\">Chris Coyier's article</a> for the button reset. Oh, I'm doing tabs stupidly, though. I feel like I'm more in CSS mode, so let me get the styling a little better, then I'll take Dawa for another walk and come back to JS-land.</p>\n<p>Oof, needs a bit more work, wow though. Can't sit anymore though :) //</p>\n<p>Boyo, we got a <em>long</em> one in! I mean, we've had longer ones, even recently, but considering being sick, that was ... how far was that? I use <a href=\"mapmyrun.com\">mapmyrun.com</a> for this type of thing ...</p>\n<p><img src=\"/walk-with-dawa.png\" alt=\"Map of 6.85 mile walk with Dawa\"></p>\n<p>Okay, made some slight changes, going to just fix up the buttons and I'm going to look for jobs to apply to! It's go time!</p>\n<p>Oh no ... the itis! I knew I shouldn't have had that last spoonful of beans, but it was sooo gooood! Alright, I need to return to this with a fresh mind. ///..</p>\n"}},"__N_SSG":true}