{"pageProps":{"post":{"title":"Wrapping","date":"2020-07-26T10:43:27.871Z","slug":"wrapping","content":"<p>Good morning! I just got all the todos to get this thing to like an acceptable state on paper, here, and Dawa's been run, he's chillen, let's do this! I'm going to title the sections what I wrote on the sketch pad:</p>\n<h3>1: Tell if it's local</h3>\n<p>Did this one, check. I wasn't sure I was running the script from the project or from pip, <code>print(\"hey\")</code> did it though. :)</p>\n<h3>2: [List of changes to the text]</h3>\n<h4>2.01: Warrantee/Specify GNU 3+ at least</h4>\n<p>Lol first of all, GNU General Public License v3 or later (GPLv3+), good try, then currently, we see:</p>\n<p>master-blaster Copyright (C) 2020 Gareth Field\nThis program comes with ABSOLUTELY NO WARRANTY;\nThis is free software, and you are welcome to redistribute it\nunder certain conditions;</p>\n<p>and now:</p>\n<p>master-blaster Copyright (C) 2020 Gareth Field\nThis program comes with ABSOLUTELY NO WARRANTY;\nThis is free software, and you are welcome to redistribute it\nunder certain conditions;\nGNU General Public License v3 or later (GPLv3+);</p>\n<p>So that's an improvement at least. The license calls for implementing show w and show c for displaying the warranty ... and ... copying ... and oh my goodness, I spelled warranty <em>way</em> off when I wrote it down just now, \"warrantee\"? Lol, we'll just leave that in, but so I decided to go all the way in this direction for the warranty and intro text:</p>\n<p>master-blaster: Rename primary branches of code repositories.\nCopyright (C) 2020 Gareth Field <a href=\"mailto:field.gareth@gmail.com\">field.gareth@gmail.com</a></p>\n<p>This program is free software: you can redistribute it and/or modify\nit under the terms of the GNU General Public License as published by\nthe Free Software Foundation, either version 3 of the License, or\n(at your option) any later version.</p>\n<p>This program is distributed in the hope that it will be useful,\nbut WITHOUT ANY WARRANTY; without even the implied warranty of\nMERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the\nGNU General Public License for more details.</p>\n<p>You should have received a copy of the GNU General Public License\nalong with this program. If not, see <a href=\"https://www.gnu.org/licenses/\">https://www.gnu.org/licenses/</a>.</p>\n<p>Whew.</p>\n<h4>2.02: master-blaster version in logfile.</h4>\n<p>Just in case anyone happens to still be using pre-1.0.5, so then their logfiles won't have it, and may be why they're having problems, apologies. Shouldn't have been anything too major, I hope.</p>\n<p>Beuno. The intro also looks beautiful now.</p>\n<h4>2.03: Switch log/Gihub notice, First:</h4>\n<p>Yeap, first part I did, changed the username prompt to have First at the front of it to be like \"really, this is the starting point of the application.\"</p>\n<h4>2.04: Confirm GitHub username</h4>\n<p>Starting with the primary verb good. More question marks bad. <code>questionary</code> is already adding question marks to every line after a prompt.</p>\n<p>?\nFirst, please enter your GitHub username!<br>\nTwitchkidd<br>\n? Confirm GitHub username: Twitchkidd (Y/n)</p>\n<p>Better! Ooo!</p>\n<p>?\nFirst, please enter your GitHub username!<br>\nTwitchkidd<br>\n? Confirm username: Twitchkidd (Y/n)</p>\n<p>Beuno.</p>\n<h4>2.05: rm parens from repotypes</h4>\n<p>Oh, yea, I'm logging the option chosen, and right now the whole string includes an explanation that collaborator/organization updates are still in development. Okay, fixed.</p>\n<h4>2.06: too many lines for local ask</h4>\n<p>It's true. Too long. But all of that was critical info, so it's two three line groupings now rather than one five line block.</p>\n<h4>2.07: rm middle sentence projects q</h4>\n<p>Hmmm, what did I mean ... Oh, that's probably okay to stay, actually. Moving on.</p>\n<h4>2.08: rm first part of token q, whitespace</h4>\n<p>Yea, the token question really needs tidying up. // Phew, that took a little doing. Got a link to the docs in there, looks more balanced ... oh yea!</p>\n<p>?\n-- Get a token! --</p>\n<p>Since password-based token generation is being deprecated,\nplease get a personal access token with the correct scope(s)\nto run this program!</p>\n<p>To get this token, go to <a href=\"https://github.com\">https://github.com</a>, sign in,\nthen go to 'Settings', then 'Developer Settings',\nthen 'Personal access tokens', then 'Generate new token',\nconfirm your password, name the token in the 'Note' input field,\nselect the public repo scope, then 'Generate Token',\nand then copy it to your clipboard.</p>\n<p>Please save it somewhere first in case there's an error!</p>\n<p>For more thorough (and visual) instructions in the GitHub docs,\nsee the personal access token part here: <a href=\"https://bit.ly/2X0cr3j\">https://bit.ly/2X0cr3j</a></p>\n<p>Paste it back here into the prompt and hit enter to continue:</p>\n<h4>2.09: git branch is being printed</h4>\n<p>Okay, processLogger updated ...</p>\n<h4>2.10: git alias printing</h4>\n<p>Yeap, processLogger updated.</p>\n<h4>2.11: switch thank you and log</h4>\n<p>Nice. All the copy is tidied up, I think.</p>\n<h3>3: Local master delete logic</h3>\n<p>Okay, switch languages, this is a problem with my Python, not my English.</p>\n<p>Ohh, that was a hack, lol, I really should have taken the time to refact it to an array, but instead I just made another parameter secondIgnoreStr=\"\" lolll. Hopefully won't need to go too much further there! 🤣</p>\n<p>Ooh, git alias is still printing, actually, my hubris bites me on the butt for not testing 2.10!</p>\n<p>Fixed fixed fixed.</p>\n<h3>4: rm dir logic</h3>\n<p>Yea, running rm -dfR on anything unecessarily is no beuno.</p>\n<p>Dope, needed to be handling error states with that process anyway. One more global variable, but no biggie.</p>\n<p>Wow, and then that's it then:</p>\n<h3>5: Directories test</h3>\n<p>So this is where I need a repo to be in each of the following states:</p>\n<p>Already has main, has master - External main conflict. (Seems the case could be made based on defaults as to whether to delete remote master.)\nAlready has main, doesn't have master - Already blasted.\nAlready has main, doesn't have master, and there's a local with main and master - Local master delete.\nDoesn't have main, has master, default is master - Blast it.\nDoesn't have main, has master, default is master, and there's a local - Locally blast it.\nDoesn't have main, has master, default isn't master - Default not master conflict.\nDoesn't have main, doesn't have master - Who.</p>\n<p>Aside ... why is it still checking collaborator and organization repos? Oh, I've messed it all up, lol.</p>\n<p>Best wishes, ~g</p>\n"}},"__N_SSG":true}